// problem 1
// შექმენით ფუნქცია რომელიც დააბრუნებს რიცხვი კენტია თუ ლუწი

function showMessage(answer) {
    if (answer % 2) { console.log("odd") }
    else { console.log("even") };
}

let answer = Number(prompt("Please enter the Number"));
showMessage(answer);


// problem2
// შექმენით ფუნქცია რომელიც მომხმარებელს შეეკითხება საკუთარ სახელს და შემდეგ დააბრუნებს მას.
//კონსოლში გამოიტანეთ რა შეიყვანა მომხმარებელმა
// (მომხმარებლისგან ინფორმაციის მისაღებად გამოიყენეთ prompt() ფუნქცია,)
// (კონსოლში დასაბეჭდათ გამოიყენეთ console.log() ფუნქცია )




let value;

while (true) {
    value = prompt("Enter your name", "");
    if (value) break;
}

alert("your name is: " + value);

console.log(value);




// problem 3
// კონსოლში დაბეჭდეთ 1-100 მდე ყველა ლუწი რიცხვი

let i = 0;
while (i < 100) {
    i += 2;
    console.log(i)
};



// problem4
// მომხმარებელს მოთხოვეთ რომ შეიყვანოს რიცხვები მანამ სანამ არ შეიყვანს უარყოფით რიცხვს

let number;

while(number>=0){
    number = prompt("Enetr the number", "");
    if (number) break;
}
alert ("numer is: " + number);
console.log(number);






// problems 5
// let numbers = [10,12,42,55,100,90,32,55];
// let result=[];
// დაწერეთ ფუნქცია რომელიც პარამეტრად მიიღებს მასივს, (პარამეტრად გამოიყენეთ numbers მასივი)
// პარამეტრად მიღებულ მასივში მოძებნის ყველა ელემენტს რომელიც იყოფა 5-ზე უნაშთოდ და ჩაწერს result მასივში.



// problem 6
// let names = ["Gio","Luka","Nika","Ani","Eka","Nini","Sopo"];
// კონსოლში დაბეჭდეთ names მასივში არსებული ყველა ელემენტი, გამოტოვეთ მხოლოდ ნიკა.
// ლუპის საშუალებით.

let names = ["Gio", "Luka", "Nika", "Ani", "Eka", "Nini", "Sopo"];

for (let i = 0; i < names.length; i++) {

    if (i == 2) {
        continue;
    }

    console.log(names[i])
};




//problem7

//შექმენით ფუნქცია რომელიც პარამეტრად მიიღებს მასივს რომელშიც იქნება მინიმუმ 5 user-ის ობიექტი
// user ობიექტი უნდა ქონდეს შემდეგი properties სახელი,გვარი,სქესი,ასაკი.
// თუ ფუნქციაში გადაცემულ პარამეტრში არ იქნებ მინიმუმ 5 მომხმარებელი დააბრუნეთ წინადადება: "მასივში აუცილებლად უნდა იყოს მინიმუმ 5 მომხმარებელი"
// თუ მინიმუმ 5 მომხმარებელი იქნება დააბრუნეთ თითოეული მათგანის სრული სახელი, გვარი და ასაკი.
// (array.length გამოიყენეთ იმისთვის რომ გაიგოთ არის თუ არა მასივში შესაბამისი რაოდენობის ელემენტი)

// problem8

// დაწერეთ ფუნქცია რომელიც პარამეტრად მიიღებს მასივს და გადაცემულ მასივში იპოვის და დააბრუნებს ყველაზე დიდ რიცხვს.

// const numbers = [
//   1, 4, 2, 14, 90, 13, 2, 0, 78, 199, 12, 313, 315, 789, 31, 12, 1, 1, 3467, 90,
//   70, 34, 43, 189,
// ];

// problem9

// დაწერეთ ფუნქცია რომელიც პარამეტრად მიიღებს მასივს და გადაცემულ მასივში იპოვის და დააბრუნებს ყველაზე პატარა რიცხვს.

// const numbers = [
//     1, 4, 2, 14, 90, 13, 2, 0, 78, 199, 12, 313, 315, 789, 31, 12, 1, 1, 3467, 90,
//     70, 34, 43, 189,
//   ];